app/views/user_mailer/order_email.html.erb

                    <tbody>
                        <% @current_cart.orders.each do |i| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."cart_id" = $1  [["cart_id", 1]]