app/mailers/user_mailer.rb

  def order_email(user)
    #on récupère l'instance user pour ensuite pouvoir la passer à la view en @user
    @user = user
    @current_cart = Cart.find_by(:user => user, :status => "on")
    quantity_total(@current_cart.orders)
    price_total(@current_cart.orders)
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 AND "carts"."status" = $2 LIMIT $3  [["user_id", 1], ["status", "on"], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."cart_id" = $1  [["cart_id", 1]]