app/controllers/carts_controller.rb

    def index
        current_cart = Cart.find_by(:user => current_user, :status => "on")

        if current_cart
            @cart_items = current_cart.orders
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 AND "carts"."status" = $2 LIMIT $3  [["user_id", 1], ["status", "on"], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."cart_id" = $1  [["cart_id", 1]]

    def create
        current_cart = Cart.find_by(:user => current_user, :status => "on")
        item = Item.find(params[:id])

        if current_cart
            if current_cart.orders
                current_cart.orders.each do |order|
                    if order.item.id == item.id
                        @reponse = true
                        @order = order
                    end
                end
                if @reponse == true
                        @order.quantity = @order.quantity + 1
                        @order.save  #nkjdsjdjks
                else
                    order = Order.create(:cart => current_cart, :item => item, :quantity => params[:quantity])
                end
            end
        end

        if not current_cart
            current_cart = Cart.create(:user => current_user, :status => "on")
            order = Order.create(:cart => current_cart, :item => item, :quantity => params[:quantity])
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 AND "carts"."status" = $2 LIMIT $3  [["user_id", 1], ["status", "on"], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."cart_id" = $1  [["cart_id", 1]]
INSERT INTO "orders" ("cart_id", "item_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cart_id", 1], ["item_id", 2], ["quantity", 3], ["created_at", "2020-09-14 18:43:18.005338"], ["updated_at", "2020-09-14 18:43:18.005338"]]
UPDATE "orders" SET "quantity" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["quantity", 2], ["updated_at", "2020-09-14 20:25:36.352449"], ["id", 4]]
INSERT INTO "carts" ("user_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["status", "on"], ["created_at", "2020-09-14 18:43:17.903596"], ["updated_at", "2020-09-14 18:43:17.903596"]]
INSERT INTO "orders" ("cart_id", "item_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cart_id", 1], ["item_id", 1], ["quantity", 1], ["created_at", "2020-09-14 18:43:26.735276"], ["updated_at", "2020-09-14 18:43:26.735276"]]