app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @item = Item.all

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
---
  def show
      @current_item = Item.find(params[:id])