app/controllers/orders_controller.rb

    def create

        if UserMailer.order_email(current_user).deliver_now
            current_cart = Cart.find_by(:user => current_user, :status => "on")
            current_cart.status = "done"
            current_cart.save
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 AND "carts"."status" = $2 LIMIT $3  [["user_id", 1], ["status", "on"], ["LIMIT", 1]]
UPDATE "carts" SET "status" = $1, "updated_at" = $2 WHERE "carts"."id" = $3  [["status", "done"], ["updated_at", "2020-09-14 18:44:03.238072"], ["id", 1]]